app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Clarence"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2023-02-24 19:04:59.506785"], ["updated_at", "2023-02-24 19:04:59.506785"]]
---
  def create
    @user = User.new(user_params)
    # debugger?
    if @user.save